Lab08/source/src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getPersonsRequests>
            <us:data>persons</us:data>
        </us:getPersonsRequests>
    </soapenv:Body>
</soapenv:Envelope>